<template>
    <div class="blog-wrapper">
        <mt-search class="blog-search" v-model="value"></mt-search>
        <mt-loadmore autoFill :top-method="loadTop" @top-status-change="handleTopPull" ref="loadmore">
            <ul class="blog-lists">
                <li v-for="item in lists">
                    <label>{{item.title}}</label>
                    <div>
                        <img :src="item.src" alt="博客图">
                        <p>{{item.alltext.length>50?item.alltext.substring(0,50)+'...':item.alltext}}</p>
                    </div>
                </li>
            </ul>
        </mt-loadmore>
        <div>
            <mt-palette-button class="blog-edit" content="+" mainButtonStyle="color:#fff;background-color:#26a2ff;" @expand="handlePublishBlog">
                <div class="my-icon-button"></div>
            </mt-palette-button>
        </div> 
    </div>
</template>
<script>
export default {
    name:'blog',
    data(){
        return{
            value:'',
            lists:[
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
                {title:'罗永浩直播带货，你会买账吗?',src:require('../assets/images/cat.jpg'),alltext:"超1.1亿销售额，累积4800万观看人数，罗永浩带货直播首秀交出的成绩单看起来不错。尽管很多人觉得直播的节奏过慢，且东西并不便宜，但罗永浩用7万多支中性笔几分钟售罄的“带货能力”表明，自己在互联网界仍旧具有举足轻重的影响力。为了请来罗永浩直播，抖音花了6000万。这6000万花得值吗？从罗永浩直播首秀带来的话题关注度看，这钱是花得值。对抖音而言，它需要开拓自己的直播业务和带货业务，增强自己的变现能力。如果从自身已有的中小主播中培养出一个李佳琪、薇娅级别的网红主播，需耗时很长且未必有成效。而请来本身具有巨大流量的罗永浩，能很快打响自身业务的知名度。很多人正是从昨夜罗永浩的直播中，第一次得知抖音还能直播卖货，也是第一次在抖音上买东西。同时，抖音也以此向品牌合作方宣示，自己拥有强大的卖货能力。这也会促成更多商家进驻抖音。"},
            ]
        }
    },
    methods:{
        handleTopPull(){},
        loadTop(){},
        handlePublishBlog(){
            this.$router.push({
                name:'editblog'
            })
        }
    },
}
</script>
<style lang="scss">
.blog-wrapper{
    width: 100vw;
    .blog-search{
        height:10vh;
        width: 100vw;
    }
    .blog-lists{
        width: 100vw;
        li{
            width: 100%;
            height:27vh;
            display: grid;
            grid-template-columns:calc(100% - 2rem);
            grid-template-rows: 7vh 20vh;
            padding:0 1rem;
            align-items: center;
            margin-bottom: 1rem;
            // border-bottom: 1px solid #333;  
            label{
                height: 100%;
                width: 100%;
                display: block;
                background-color: #E3F4FF;
                font-size: 1rem;
                line-height: 7vh;
            }         
            &> div{
                background-color: #E3F4FF;
                display: grid;
                grid-template-columns: 40% 60%;
                grid-template-rows: 22vh;                
                align-items: center;
                p{  
                    padding: 0.5rem 1rem;
                    display: block;
                    font-size: 0.7rem;
                } 
                img{
                    width: 5rem;
                    height: 5rem;
                    position: relative;
                    left:50%;
                    transform: translate(-50%,0);
                }
            }
        }
    }
    .blog-edit{
        position: fixed;
        bottom: 5rem;
        right: 2rem;
    }
}
</style>